
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       1 |          1 |           1 |
## Affected resources by action

|  Action  | Resources                        |
|:--------:|:---------------------------------|
|    🟡     | `module.ecs.aws_ecs_service.ecs` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry"
        name                               = "terraform-registry"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:11" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "terraform-registry" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDF9fQ==
```
</details>